Rajshekhar-EM/IMXRT1050EVK_Bootloader/BD155_P_V1_0_0/McuXpresso/VMS_Display_V0/sdmmc/src/fsl_sd.c
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    uint32_t *rawScr             = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error               = kStatus_Success;

    /* memset the global buffer */
    (void)memset(rawScr, 0, 8U);

    if (kStatus_Success != SD_SendApplicationCmd(card, card->relativeAddress))
    {
        return kStatus_SDMMC_SendApplicationCommandFailed;
    }

    command.index        = (uint32_t)kSD_ApplicationSendScr;
    command.responseType = kCARD_ResponseTypeR1;
    command.argument     = 0U;

    data.blockSize  = 8U;
    data.blockCount = 1U;
    data.rxData     = rawScr;

    content.data    = &data;
    content.command = &command;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success != error) || (((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        SDMMC_LOG("\r\nError: send ACMD51 failed with host error %d, response %x", error, command.response[0U]);
    }
    else
    {
        /* SCR register data byte sequence from card is big endian(MSB first). */
        if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeLittle)
        {
            /* In little endian mode, SD bus byte transferred first is the byte stored in lowest byte position in a
            word which will cause 4 byte's sequence in a word is not consistent with their original sequence from
            card. So the sequence of 4 bytes received in a word should be converted. */
            rawScr[0U] = SWAP_WORD_BYTE_SEQUENCE(rawScr[0U]);
            rawScr[1U] = SWAP_WORD_BYTE_SEQUENCE(rawScr[1U]);
        }
        else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeHalfWordBig)
        {
            rawScr[0U] = SWAP_HALF_WROD_BYTE_SEQUENCE(rawScr[0U]);
            rawScr[1U] = SWAP_HALF_WROD_BYTE_SEQUENCE(rawScr[1U]);
        }
        else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeBig)
        {
            /* nothing to do */
        }
        else
        {
            return kStatus_SDMMC_NotSupportYet;
        }

        /* decode scr */
        SD_DecodeScr(card, rawScr);
    }

    return error;
}

static status_t SD_SelectFunction(sd_card_t *card, uint32_t group, uint32_t function)
{
    assert(card != NULL);

    uint32_t *functionStatus       = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    uint16_t functionGroupInfo[6U] = {0};
    uint32_t currentFunctionStatus = 0U;
    status_t error                 = kStatus_Success;

    /* memset the global buffer */
    (void)memset(functionStatus, 0, 64U);

    /* check if card support CMD6 */
    if ((card->version <= (uint32_t)kSD_SpecificationVersion1_0) ||
        (0U == (card->csd.cardCommandClass & (uint32_t)kSDMMC_CommandClassSwitch)))
    {
        SDMMC_LOG("\r\nError: current card not support CMD6");
        return kStatus_SDMMC_NotSupportYet;
    }

    error = SD_SwitchFunction(card, (uint32_t)kSD_SwitchCheck, group, function, functionStatus);
    /* Check if card support high speed mode. */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeLittle)
    {
        /* In little endian mode, SD bus byte transferred first is the byte stored in lowest byte position in
        a word which will cause 4 byte's sequence in a word is not consistent with their original sequence from
        card. So the sequence of 4 bytes received in a word should be converted. */
        functionStatus[0U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[0U]);
        functionStatus[1U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[1U]);
        functionStatus[2U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[2U]);
        functionStatus[3U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[3U]);
        functionStatus[4U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[4U]);
    }
    else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeHalfWordBig)
    {
        functionStatus[0U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[0U]);
        functionStatus[1U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[1U]);
        functionStatus[2U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[2U]);
        functionStatus[3U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[3U]);
        functionStatus[4U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[4U]);
    }
    else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeBig)
    {
        /* nothing to do */
    }
    else
    {
        return kStatus_SDMMC_NotSupportYet;
    }

    /* -functionStatus[0U]---bit511~bit480;
       -functionStatus[1U]---bit479~bit448;
       -functionStatus[2U]---bit447~bit416;
       -functionStatus[3U]---bit415~bit384;
       -functionStatus[4U]---bit383~bit352;
       According to the "switch function status[bits 511~0]" return by switch command in mode "check function":
       -Check if function 1(high speed) in function group 1 is supported by checking if bit 401 is set;
       -check if function 1 is ready and can be switched by checking if bits 379~376 equal value 1;
     */
    functionGroupInfo[5U] = (uint16_t)functionStatus[0U];
    functionGroupInfo[4U] = (uint16_t)(functionStatus[1U] >> 16U);
    functionGroupInfo[3U] = (uint16_t)(functionStatus[1U]);
    functionGroupInfo[2U] = (uint16_t)(functionStatus[2U] >> 16U);
    functionGroupInfo[1U] = (uint16_t)(functionStatus[2U]);
    functionGroupInfo[0U] = (uint16_t)(functionStatus[3U] >> 16U);
    currentFunctionStatus = ((functionStatus[3U] & 0xFFU) << 8U) | (functionStatus[4U] >> 24U);

    /* check if function is support */
    if (((functionGroupInfo[group] & (1UL << function)) == 0U) ||
        ((currentFunctionStatus >> (group * 4U)) & 0xFU) != function)
    {
        SDMMC_LOG("\r\nError: current card not support function %d", function);
        return kStatus_SDMMC_NotSupportYet;
    }

    error = SD_SwitchFunction(card, (uint32_t)kSD_SwitchSet, group, function, functionStatus);
    /* Switch to high speed mode. */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeLittle)
    {
        /* In little endian mode is little endian, SD bus byte transferred first is the byte stored in lowest byte
        position in a word which will cause 4 byte's sequence in a word is not consistent with their original
        sequence from card. So the sequence of 4 bytes received in a word should be converted. */
        functionStatus[3U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[3U]);
        functionStatus[4U] = SWAP_WORD_BYTE_SEQUENCE(functionStatus[4U]);
    }
    else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeHalfWordBig)
    {
        functionStatus[3U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[3U]);
        functionStatus[4U] = SWAP_HALF_WROD_BYTE_SEQUENCE(functionStatus[4U]);
    }
    else if ((uint32_t)card->host->hostController.config.endianMode == (uint32_t)kSDMMCHOST_EndianModeBig)
    {
        /* Doesn't need to switch byte sequence when decodes bytes as big endian sequence */
    }
    else
    {
        return kStatus_SDMMC_NotSupportYet;
    }

    /* According to the "switch function status[bits 511~0]" return by switch command in mode "set function":
       -check if group 1 is successfully changed to function 1 by checking if bits 379~376 equal value 1;
     */
    currentFunctionStatus = ((functionStatus[3U] & 0xFFU) << 8U) | (functionStatus[4U] >> 24U);

    if (((currentFunctionStatus >> (group * 4U)) & 0xFU) != function)
    {
        SDMMC_LOG("\r\nError: switch to function %d failed", function);
        return kStatus_SDMMC_SwitchFailed;
    }

    return kStatus_Success;
}

static status_t SD_SetDataBusWidth(sd_card_t *card, uint32_t width)
{
    assert(card != NULL);

